<?php
  
namespace Database\Seeders;
  
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
  
class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $permissions = [    

             // صلاحيات الأدوار
             'عرض الأدوار',
             'عرض دور',
             'إضافة دور',
             'تعديل دور',
             'حذف دور',

            // صلاحيات الأخبار والتصنيفات
            'عرض الأخبار والتصنيفات',
            'إضافة خبر',
            'تعديل خبر',
            'حذف خبر',
            'عرض تصنيفات الأخبار',
            'إضافة تصنيف',
            'تعديل تصنيف',
            'حذف تصنيف',
            
            // صلاحيات العناوين
            'عرض العناوين',
            'إضافة عنوان رئيسي',
            'تعديل عنوان رئيسي',
            'حذف عنوان رئيسي',
            'عرض العناوين الفرعية',
            'إضافة عنوان فرعي',
            'تعديل عنوان فرعي',
            'حذف عنوان فرعي',
            
            // صلاحيات المخازن
            'عرض المخازن',
            'إضافة مخزن',
            'تعديل مخزن',
            'حذف مخزن',
            
            // صلاحيات الطلبات
            'تحديد كمية الطلبات',
            'عرض الكميات',
            'إصدار تقارير شهرية',
            'عرض تقارير الطلبات',
            'حذف تقرير',
            'فرز الطلبات',
            'عرض جميع الطلبات',
            'تحديد أجرة التوصيل',
            
            // صلاحيات المنتجات
            'عرض المنتجات',
            'إضافة منتج',
            'تعديل منتج',
            'حذف منتج',
            
            // صلاحيات العميل
            'متابعة الطلبات',
            'عرض تفاصيل الطلب',
            'إلغاء الطلبات',
            
            // صلاحيات الشكاوي
            'عرض الشكاوي',
            'إضافة شكوى',
            'حذف شكوى',
            
            // صلاحيات التقييمات
            'عرض التقييمات',
            'إضافة تقييم',
            'حذف تقييم',
            
            // صلاحيات الإشعارات
            'عرض إشعارات المتابعة',
            'تعديل إشعار',
            'حذف إشعار',
        ];
        
        foreach ($permissions as $permission) {
             Permission::create(['name' => $permission]);
        }
    }
}
