<?php

return [

    'control_panel'=>' لوحة التحكم ',

    'components' => ' المكونات ',

    'sections' => ' الاقسام ',

    'ads' => ' الاعلانات ',

    'users' => ' المستخدمين ',
    'show_users' => ' عرض المستخدمين  ',
    'add_user' => ' اضافة مستخدم   ',

    'roles' => ' الادوار ',
    'show_roles' => ' عرض الادوار  ',
    'add_role' => ' اضافة دور  ',


    'welcome' => ' مرحبا بكم ',
    'auth_success' => '  تم تسجيلك  بنجاح ',
    'auth_error' => 'البريد الإلكتروني وكلمة المرور لا يتطابقان  ',
























    // Login Message
    'failed' => 'يوجد خطا في البريد الالكتروني او كلمة المرور',

    // message
    'add' => 'تم حفظ البيانات بنجاح',
    'edit' => 'تم تعديل البيانات بنجاح',
    'delete' => 'تم حذف البيانات بنجاح',

    // validation Message
    'required' => ' حقل  مطلوب',
    'string' => 'حقل  لابد ان يكون احرف ',
    'min' => ' حقل الاسم لا يقل :n عن حرفا ',
    'max' => 'حقل  لا يزيد عن :n حرفًا',
    'email' => 'رجى إدخال عنوان بريد إلكتروني صالح',
    'confirmed' => 'حقل كلمة المرور لابد عن يكون متطابق.',

];
