<?php

return [

    // Login Message
    'failed' => 'يوجد خطا في البريد الالكتروني او كلمة المرور',







    // message
    'add' => 'تم حفظ البيانات بنجاح',
    'edit' => 'تم تعديل البيانات بنجاح',
    'delete' => 'تم حذف البيانات بنجاح',

    // validation Message
    'required' => ' حقل  مطلوب',
    'string' => 'حقل  لابد ان يكون احرف ',
    'min' => ' حقل الاسم لا يقل :n عن حرفا ',
    'max' => 'حقل  لا يزيد عن :n حرفًا',
    'email' => 'رجى إدخال عنوان بريد إلكتروني صالح',
    'confirmed' => 'حقل كلمة المرور لابد عن يكون متطابق.',

];
